nxp-mcuxpresso/mcux-soc-svd/MCXN946T/MCXN946T_cm33_core1.xml
        <register>
          <name>PF</name>
          <description>Pin Flag</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>WUF0</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF1</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF2</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF3</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF4</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF5</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF6</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF7</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF8</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF9</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF10</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF11</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF12</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF13</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF14</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF15</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF16</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF17</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF18</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF19</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF20</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF21</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF22</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF23</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF24</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF25</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF26</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF27</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF28</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF29</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FLAG</name>
                  <description>No</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLAG</name>
                  <description>Yes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUF30</name>
              <description>Wake-up Flag for WUU_Pn</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
