nxp-mcuxpresso/mcux-soc-svd/MCXN946T/MCXN946T_cm33_core1.xml
        <register>
          <name>GPCHR</name>
          <description>Global Pin Control High</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPWD</name>
              <description>Global Pin Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPWE16</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE17</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE18</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE19</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE20</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE21</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE22</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE23</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE24</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE25</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE26</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE27</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE28</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE29</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE30</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPWE31</name>
              <description>Global Pin Write Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gpwe0</name>
                  <description>Not updated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gpwe1</name>
                  <description>Updated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANGE</name>
              <description>Port Voltage Range</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>range0</name>
                  <description>1.71 V-3.6 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>range1</name>
                  <description>2.70 V-3.6 V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
